$(document).ready(function(){
  $("#accordion1").accordion();
  $("#accordion2").accordion();
  
  const availableCountries = ['Австралия',
  'Австрия',
  'Азербайджан',
  'Аргентина',
  'Афганистан',
  'Бангладеш',
  'Беларусь',
  'Бразилия',
  'Великобритания ',
  'Вьетнам',
  'Германия',
  'Греция',
  'Грузия',
  'Дания',
  'Египет',
  'Израиль',
  'Ирак',
  'Иран',
  'Испания ',
  'Италия',
  'Канада',
  'Киргизия',
  'КНР',
  'Куба',
  'Латвия',
  'Литва',
  'Мексика',
  'Молдавия',
  'Монголия',
  'Нигерия',
  'Нидерланды ',
  'Пакистан',
  'Польша',
  'Португалия',
  'Россия',
  'Румыния',
  'Сербия',
  'Словакия',
  'Словения',
  'США',
  'Таджикистан ',
  'Таиланд',
  'Тунис ',
  'Турция',
  'Узбекистан',
  'Украина',
  'Филиппины',
  'Финляндия',
  'Франция',
  'Хорватия',
  'Черногория',
  'Чехия',
  'Швейцария ',
  'Швеция',
  'Эстония',
  'ЮАР',
  'Япония'];
  $("#auto").autocomplete({
    source: availableCountries,
    minLength: 3
  });

  $("#el1, #el2, #el3").addClass('button');
  $("#el3").addClass('button--long');
  $("#el3 input[type='checkbox']").css("display", "none");
  $("#el3 label:not(:last-of-type)").addClass('label');

  $("#el3 label:not(:last-of-type)").css({
    "border-right": "1px solid rgb(0,79,86)",
    "padding-right": "5px"
  });

});